<script>
/* ===== КТ по регионам ===== */
const KT_MAP = {
  // Города федерального значения
  "77": { name: "Москва", baseKT: 1.8, cities: null },
  "78": { name: "Санкт-Петербург", baseKT: 1.64, cities: null },
  "92": { name: "Севастополь", baseKT: 0.82, cities: null },

  // Республики
  "01": { name: "Республика Адыгея", baseKT: 1.24, cities: null },
  "04": {
    name: "Республика Алтай",
    baseKT: null,
    cities: {
      "Горно-Алтайск": 1.24,
      "Прочие города и НП": 0.84
    }
  },
  "02": {
    name: "Республика Башкортостан",
    baseKT: null,
    cities: {
      "Уфа": 1.56,
      "Благовещенск, Октябрьский": 1.16,
      "Ишимбай, Кумертау, Салават": 1.08,
      "Стерлитамак, Туймазы": 1.24,
      "Прочие города и НП": 1
    }
  },
  "03": {
    name: "Республика Бурятия",
    baseKT: null,
    cities: {
      "Улан-Удэ": 1.24,
      "Прочие города и НП": 0.76
    }
  },
  "05": {
    name: "Республика Дагестан",
    baseKT: null,
    cities: {
      "Буйнакск, Дербент, Каспийск, Махачкала, Хасавюрт": 1,
      "Прочие города и НП": 1
    }
  },
  "80": { name: "Донецкая Народная Республика", baseKT: 0.68, cities: null },
  "06": {
    name: "Республика Ингушетия",
    baseKT: null,
    cities: {
      "Назрань, Прочие города и НП": 1.64,
      "Малгобек": 1.88
    }
  },
  "07": {
    name: "Кабардино-Балкарская Республика",
    baseKT: null,
    cities: {
      "Нальчик, Прохладный": 1,
      "Прочие города и НП": 0.88
    }
  },
  "08": {
    name: "Республика Калмыкия",
    baseKT: null,
    cities: {
      "Элиста": 1.24,
      "Прочие города и НП": 0.9
    }
  },
  "09": { name: "Карачаево-Черкесская Республика", baseKT: 1, cities: null },
  "10": {
    name: "Республика Карелия",
    baseKT: null,
    cities: {
      "Петрозаводск": 1.24,
      "Прочие города и НП": 0.84
    }
  },
  "11": {
    name: "Республика Коми",
    baseKT: null,
    cities: {
      "Сыктывкар": 1.38,
      "Ухта": 1.14,
      "Прочие города и НП": 1
    }
  },
  "91": {
    name: "Республика Крым",
    baseKT: null,
    cities: {
      "Симферополь": 0.76,
      "Прочие города и НП": 0.75
    }
  },
  "81": { name: "Луганская Народная Республика", baseKT: 0.68, cities: null },
  "12": {
    name: "Республика Марий Эл",
    baseKT: null,
    cities: {
      "Йошкар-Ола": 1.32,
      "Волжск": 1,
      "Прочие города и НП": 0.76
    }
  },
  "13": {
    name: "Республика Мордовия",
    baseKT: null,
    cities: {
      "Саранск": 1.4,
      "Рузаевка": 1.16,
      "Прочие города и НП": 0.84
    }
  },
  "14": {
    name: "Республика Саха (Якутия)",
    baseKT: null,
    cities: {
      "Якутск": 1.16,
      "Нерюнгри": 0.92,
      "Прочие города и НП": 0.75
    }
  },
  "15": {
    name: "Республика Северная Осетия — Алания",
    baseKT: null,
    cities: {
      "Владикавказ": 1,
      "Прочие города и НП": 0.94
    }
  },
  "16": {
    name: "Республика Татарстан",
    baseKT: null,
    cities: {
      "Казань": 1.7,
      "Альметьевск, Зеленодольск, Нижнекамск": 1.24,
      "Бугульма, Лениногорск, Чистополь": 1,
      "Елабуга": 1.16,
      "Набережные Челны": 1.56,
      "Прочие города и НП": 1.08
    }
  },
  "17": { name: "Республика Тыва", baseKT: 0.9, cities: null },
  "18": {
    name: "Удмуртская Республика",
    baseKT: null,
    cities: {
      "Ижевск": 1.48,
      "Воткинск": 1.08,
      "Глазов, Сарапул": 1,
      "Прочие города и НП": 0.92
    }
  },
  "19": {
    name: "Республика Хакасия",
    baseKT: null,
    cities: {
      "Абакан, Саяногорск, Черногорск": 1,
      "Прочие города и НП": 0.82
    }
  },
  "20": { name: "Чеченская Республика", baseKT: 0.9, cities: null },
  "21": {
    name: "Чувашская Республика",
    baseKT: null,
    cities: {
      "Чебоксары": 1.46,
      "Канаш": 1.08,
      "Новочебоксарск": 1.16,
      "Прочие города и НП": 0.97
    }
  },

  // Края
  "22": {
    name: "Алтайский край",
    baseKT: null,
    cities: {
      "Барнаул": 1.49,
      "Бийск": 1.16,
      "Заринск, Новоалтайск, Рубцовск": 1.08,
      "Прочие города и НП": 0.84
    }
  },
  "75": {
    name: "Забайкальский край",
    baseKT: null,
    cities: {
      "Чита, Краснокаменск": 0.82,
      "Прочие города и НП": 0.68
    }
  },
  "41": {
    name: "Камчатский край",
    baseKT: null,
    cities: {
      "Петропавловск-Камчатский": 1.24,
      "Прочие города и НП": 1
    }
  },
  "23": {
    name: "Краснодарский край",
    baseKT: null,
    cities: {
      "Краснодар, Новороссийск": 1.56,
      "Анапа, Геленджик": 1.24,
      "Армавир, Сочи, Туапсе": 1.16,
      "Белореченск, Ейск, Кропоткин, Крымск, Курганинск, Лабинск, Славянск-на-Кубани, Тимашевск, Тихорецк": 1.08,
      "Прочие города и НП": 1
    }
  },
  "24": {
    name: "Красноярский край",
    baseKT: null,
    cities: {
      "Красноярск": 1.56,
      "Ачинск, Зеленогорск": 1.08,
      "Железногорск, Норильск": 1.24,
      "Канск, Лесосибирск, Минусинск, Назарово": 1,
      "Прочие города и НП": 0.92
    }
  },
  "59": {
    name: "Пермский край",
    baseKT: null,
    cities: {
      "Пермь": 1.6,
      "Березники": 1.24,
      "Краснокамск": 1.14,
      "Лысьва, Чайковский": 1,
      "Соликамск": 1.16,
      "Прочие города и НП": 1.07
    }
  },
  "25": {
    name: "Приморский край",
    baseKT: null,
    cities: {
      "Владивосток": 1.36,
      "Арсеньев, Артем, Находка, Спасск-Дальний, Уссурийск": 1,
      "Прочие города и НП": 1
    }
  },
  "26": {
    name: "Ставропольский край",
    baseKT: null,
    cities: {
      "Кисловодск, Михайловск, Ставрополь": 1.16,
      "Буденновск, Георгиевск, Ессентуки, Минеральные Воды, Невинномысск, Пятигорск": 1,
      "Прочие города и НП": 0.84
    }
  },
  "27": {
    name: "Хабаровский край",
    baseKT: null,
    cities: {
      "Хабаровск": 1.56,
      "Амурск": 1,
      "Комсомольск-на-Амуре": 1.27,
      "Прочие города и НП": 0.97
    }
  },

  // Области
  "28": {
    name: "Амурская область",
    baseKT: null,
    cities: {
      "Благовещенск": 1.48,
      "Белогорск, Свободный": 1.08,
      "Прочие города и НП": 1
    }
  },
  "29": {
    name: "Архангельская область",
    baseKT: null,
    cities: {
      "Архангельск": 1.64,
      "Котлас": 1.38,
      "Северодвинск": 1.46,
      "Прочие города и НП": 0.88
    }
  },
  "30": {
    name: "Астраханская область",
    baseKT: null,
    cities: {
      "Астрахань": 1.32,
      "Прочие города и НП": 0.84
    }
  },
  "31": {
    name: "Белгородская область",
    baseKT: null,
    cities: {
      "Белгород": 1.24,
      "Губкин, Старый Оскол": 1,
      "Прочие города и НП": 0.84
    }
  },
  "32": {
    name: "Брянская область",
    baseKT: null,
    cities: {
      "Брянск": 1.4,
      "Клинцы": 1,
      "Прочие города и НП": 0.76
    }
  },
  "33": {
    name: "Владимирская область",
    baseKT: null,
    cities: {
      "Владимир": 1.38,
      "Гусь-Хрустальный": 1.08,
      "Муром": 1.16,
      "Прочие города и НП": 1
    }
  },
  "34": {
    name: "Волгоградская область",
    baseKT: null,
    cities: {
      "Волгоград": 1.21,
      "Волжский": 1.08,
      "Камышин, Михайловка": 1,
      "Прочие города и НП": 0.84
    }
  },
  "35": {
    name: "Вологодская область",
    baseKT: null,
    cities: {
      "Вологда": 1.46,
      "Череповец": 1.54,
      "Прочие города и НП": 0.92
    }
  },
  "36": {
    name: "Воронежская область",
    baseKT: null,
    cities: {
      "Воронеж": 1.35,
      "Борисоглебск, Лиски, Россошь": 1.08,
      "Прочие города и НП": 0.84
    }
  },
  "85": { name: "Запорожская область", baseKT: 0.68, cities: null },
  "37": {
    name: "Ивановская область",
    baseKT: null,
    cities: {
      "Иваново": 1.54,
      "Кинешма": 1.08,
      "Шуя": 1,
      "Прочие города и НП": 0.92
    }
  },
  "38": {
    name: "Иркутская область",
    baseKT: null,
    cities: {
      "Иркутск": 1.49,
      "Ангарск": 1.16,
      "Братск, Тулун, Усть-Илимск, Усть-Кут, Черемхово": 1,
      "Усолье-Сибирское": 1.08,
      "Шелехов": 1.24,
      "Прочие города и НП": 0.92
    }
  },
  "39": {
    name: "Калининградская область",
    baseKT: null,
    cities: {
      "Калининград": 1.08,
      "Прочие города и НП": 0.92
    }
  },
  "40": {
    name: "Калужская область",
    baseKT: null,
    cities: {
      "Калуга": 1.16,
      "Обнинск": 1.24,
      "Прочие города и НП": 1
    }
  },
  "42": {
    name: "Кемеровская область — Кузбасс",
    baseKT: null,
    cities: {
      "Кемерово": 1.62,
      "Анжеро-Судженск, Киселевск, Юрга": 1.16,
      "Белово, Березовский, Междуреченск, Осинники, Прокопьевск": 1.24,
      "Новокузнецк": 1.64,
      "Прочие города и НП": 1.07
    }
  },
  "43": {
    name: "Кировская область",
    baseKT: null,
    cities: {
      "Киров": 1.32,
      "Кирово-Чепецк": 1.16,
      "Прочие города и НП": 0.84
    }
  },
  "44": {
    name: "Костромская область",
    baseKT: null,
    cities: {
      "Кострома": 1.24,
      "Прочие города и НП": 0.76
    }
  },
  "45": {
    name: "Курганская область",
    baseKT: null,
    cities: {
      "Курган": 1.32,
      "Шадринск": 1.08,
      "Прочие города и НП": 0.84
    }
  },
  "46": {
    name: "Курская область",
    baseKT: null,
    cities: {
      "Курск": 1.16,
      "Железногорск": 1,
      "Прочие города и НП": 0.76
    }
  },
  "47": { name: "Ленинградская область", baseKT: 1.24, cities: null },
  "48": {
    name: "Липецкая область",
    baseKT: null,
    cities: {
      "Липецк": 1.4,
      "Елец": 1,
      "Прочие города и НП": 0.92
    }
  },
  "49": {
    name: "Магаданская область",
    baseKT: null,
    cities: {
      "Магадан": 0.9,
      "Прочие города и НП": 0.84
    }
  },
  "50": { name: "Московская область", baseKT: 1.56, cities: null },
  "51": {
    name: "Мурманская область",
    baseKT: null,
    cities: {
      "Мурманск": 1.78,
      "Апатиты": 1.24,
      "Мончегорск": 1.14,
      "Североморск": 1.48,
      "Прочие города и НП": 1.16
    }
  },
  "52": {
    name: "Нижегородская область",
    baseKT: null,
    cities: {
      "Нижний Новгород": 1.56,
      "Арзамас, Выкса, Саров": 1.08,
      "Балахна, Бор, Дзержинск": 1.24,
      "Кстово": 1.16,
      "Прочие города и НП": 1
    }
  },
  "53": {
    name: "Новгородская область",
    baseKT: null,
    cities: {
      "Великий Новгород": 1.24,
      "Боровичи": 1,
      "Прочие города и НП": 0.92
    }
  },
  "54": {
    name: "Новосибирская область",
    baseKT: null,
    cities: {
      "Новосибирск": 3.12,
      "Бердск": 2.48,
      "Искитим": 2.32,
      "Куйбышев": 2,
      "Прочие города и НП": 2
    }
  },
  "55": {
    name: "Омская область",
    baseKT: null,
    cities: {
      "Омск": 1.42,
      "Прочие города и НП": 1
    }
  },
  "56": {
    name: "Оренбургская область",
    baseKT: null,
    cities: {
      "Оренбург": 1.56,
      "Бугуруслан, Бузулук, Новотроицк": 1,
      "Орск": 1.08,
      "Прочие города и НП": 0.92
    }
  },
  "57": {
    name: "Орловская область",
    baseKT: null,
    cities: {
      "Орел": 1.16,
      "Ливны, Мценск": 1,
      "Прочие города и НП": 0.76
    }
  },
  "58": {
    name: "Пензенская область",
    baseKT: null,
    cities: {
      "Пенза": 1.32,
      "Заречный": 1.16,
      "Кузнецк": 1,
      "Прочие города и НП": 0.84
    }
  },
  "60": {
    name: "Псковская область",
    baseKT: null,
    cities: {
      "Псков": 1.16,
      "Великие Луки": 1,
      "Прочие города и НП": 0.76
    }
  },
  "61": {
    name: "Ростовская область",
    baseKT: null,
    cities: {
      "Ростов-на-Дону": 1.56,
      "Азов": 1.16,
      "Батайск": 1.24,
      "Волгодонск, Гуково, Каменск-Шахтинский, Новочеркасск, Новошахтинск, Сальск, Таганрог": 1,
      "Шахты": 1.08,
      "Прочие города и НП": 0.84
    }
  },
  "62": {
    name: "Рязанская область",
    baseKT: null,
    cities: {
      "Рязань": 1.32,
      "Прочие города и НП": 0.92
    }
  },
  "63": {
    name: "Самарская область",
    baseKT: null,
    cities: {
      "Самара": 1.48,
      "Новокуйбышевск, Сызрань": 1.08,
      "Тольятти": 1.35,
      "Чапаевск": 1.16,
      "Прочие города и НП": 0.92
    }
  },
  "64": {
    name: "Саратовская область",
    baseKT: null,
    cities: {
      "Саратов": 1.42,
      "Балаково, Балашов, Вольск": 1,
      "Энгельс": 1.16,
      "Прочие города и НП": 0.76
    }
  },
  "65": {
    name: "Сахалинская область",
    baseKT: null,
    cities: {
      "Южно-Сахалинск": 1.4,
      "Прочие города и НП": 0.92
    }
  },
  "66": {
    name: "Свердловская область",
    baseKT: null,
    cities: {
      "Екатеринбург": 1.64,
      "Асбест, Ревда": 1.08,
      "Березовский, Верхняя Пышма, Первоуральск": 1.24,
      "Новоуральск": 1.14,
      "Полевской": 1.16,
      "Верхняя Салда": 1.06,
      "Прочие города и НП": 1
    }
  },
  "67": {
    name: "Смоленская область",
    baseKT: null,
    cities: {
      "Смоленск": 1.16,
      "Вязьма, Рославль, Сафоново, Ярцево": 1,
      "Прочие города и НП": 0.84
    }
  },
  "68": {
    name: "Тамбовская область",
    baseKT: null,
    cities: {
      "Тамбов": 1.16,
      "Мичуринск": 1,
      "Прочие города и НП": 0.84
    }
  },
  "69": {
    name: "Тверская область",
    baseKT: null,
    cities: {
      "Тверь": 1.4,
      "Вышний Волочек, Кимры, Ржев": 1,
      "Прочие города и НП": 0.92
    }
  },
  "70": {
    name: "Томская область",
    baseKT: null,
    cities: {
      "Томск": 1.48,
      "Северск": 1.16,
      "Прочие города и НП": 0.92
    }
  },
  "71": {
    name: "Тульская область",
    baseKT: null,
    cities: {
      "Тула": 1.4,
      "Алексин, Ефремов, Новомосковск": 1,
      "Узловая, Щекино": 1.16,
      "Прочие города и НП": 0.92
    }
  },
  "72": {
    name: "Тюменская область",
    baseKT: null,
    cities: {
      "Тюмень": 1.6,
      "Тобольск": 1.24,
      "Прочие города и НП": 1.07
    }
  },
  "73": {
    name: "Ульяновская область",
    baseKT: null,
    cities: {
      "Ульяновск": 1.4,
      "Димитровград": 1.16,
      "Прочие города и НП": 0.92
    }
  },
  "84": { name: "Херсонская область", baseKT: 0.68, cities: null },
  "74": {
    name: "Челябинская область",
    baseKT: null,
    cities: {
      "Челябинск": 1.77,
      "Златоуст, Миасс": 1.32,
      "Копейск": 1.48,
      "Магнитогорск": 1.64,
      "Сатка, Чебаркуль": 1.16,
      "Прочие города и НП": 1
    }
  },
  "76": {
    name: "Ярославская область",
    baseKT: null,
    cities: {
      "Ярославль": 1.4,
      "Прочие города и НП": 1
    }
  },
  "79": { name: "Еврейская АО", baseKT: 0.9, cities: null },

  // Автономные округи
  "83": { name: "Ненецкий АО", baseKT: 0.84, cities: null },
  "86": {
    name: "Ханты-Мансийский АО — Югра",
    baseKT: null,
    cities: {
      "Ханты-Мансийск": 1.3,
      "Когалым": 1,
      "Нефтеюганск, Нягань": 1.24,
      "Сургут": 1.7,
      "Нижневартовск": 1.64,
      "Прочие города и НП": 1.07
    }
  },
  "87": { name: "Чукотский АО", baseKT: 0.76, cities: null },
  "89": {
    name: "Ямало-Ненецкий АО",
    baseKT: null,
    cities: {
      "Новый Уренгой": 1,
      "Ноябрьск": 1.46,
      "Прочие города и НП": 1.08
    }
  },
  "99": { name: "Байконур", baseKT: 0.82, cities: null }
};

/* ===== ТАБЛИЦА КТ ДЛЯ ТРАКТОРОВ (2026) ===== */
const KT_TRACTOR_MAP = {
  // Города федерального значения
  "77": { name: "Москва", baseKT: 1.24, cities: null },
  "78": { name: "Санкт-Петербург", baseKT: 1.0, cities: null },
  "92": { name: "Севастополь", baseKT: 0.82, cities: null },

  // Республики
  "01": { name: "Республика Адыгея", baseKT: 1.0, cities: null },
  "04": {
    name: "Республика Алтай",
    baseKT: null,
    cities: {
      "Горно-Алтайск": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "02": {
    name: "Республика Башкортостан",
    baseKT: null,
    cities: {
      "Уфа": 1.0,
      "Благовещенск, Октябрьский": 0.84,
      "Ишимбай, Кумертау, Салават": 0.84,
      "Стерлитамак, Туймазы": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "03": {
    name: "Республика Бурятия",
    baseKT: null,
    cities: {
      "Улан-Удэ": 0.84,
      "Прочие города и НП": 0.7
    }
  },
  "05": {
    name: "Республика Дагестан",
    baseKT: null,
    cities: {
      "Буйнакск, Дербент, Каспийск, Махачкала, Хасавюрт": 0.84,
      "Прочие города и НП": 0.92
    }
  },
  "80": { name: "Донецкая Народная Республика", baseKT: 0.68, cities: null },
  "06": {
    name: "Республика Ингушетия",
    baseKT: null,
    cities: {
      "Назрань": 1.52,
	  "Малогбек": 1.52,
      "Прочие города и НП": 1.52
    }
  },
  "07": {
    name: "Кабардино-Балкарская Республика",
    baseKT: null,
    cities: {
      "Нальчик, Прохладный": 0.84,
      "Прочие города и НП": 0.76
    }
  },
  "08": {
    name: "Республика Калмыкия",
    baseKT: null,
    cities: {
      "Элиста": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "09": { name: "Карачаево-Черкесская Республика", baseKT: 0.88, cities: null },
  "10": {
    name: "Республика Карелия",
    baseKT: null,
    cities: {
      "Петрозаводск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "11": {
    name: "Республика Коми",
    baseKT: null,
    cities: {
      "Сыктывкар": 1.0,
      "Ухта": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "91": {
    name: "Республика Крым",
    baseKT: null,
    cities: {
      "Симферополь": 0.76,
      "Прочие города и НП": 0.75
    }
  },
  "81": { name: "Луганская Народная Республика", baseKT: 0.68, cities: null },
  "12": {
    name: "Республика Марий Эл",
    baseKT: null,
    cities: {
      "Йошкар-Ола": 0.84,
      "Волжск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "13": {
    name: "Республика Мордовия",
    baseKT: null,
    cities: {
      "Саранск": 1.0,
      "Рузаевка": 0.84,
      "Прочие города и НП": 0.68
    }
  },
  "14": {
    name: "Республика Саха (Якутия)",
    baseKT: null,
    cities: {
      "Якутск": 0.76,
      "Нерюнгри": 0.66,
      "Прочие города и НП": 0.66
    }
  },
  "15": {
    name: "Республика Северная Осетия — Алания",
    baseKT: null,
    cities: {
      "Владикавказ": 0.88,
      "Прочие города и НП": 0.76
    }
  },
  "16": {
    name: "Республика Татарстан",
    baseKT: null,
    cities: {
      "Казань": 1.14,
      "Альметьевск, Зеленодольск, Нижнекамск": 0.84,
      "Бугульма, Лениногорск, Чистополь": 0.84,
      "Елабуга": 0.84,
      "Набережные Челны": 1.0,
      "Прочие города и НП": 0.84
    }
  },
  "17": {
    name: "Республика Тыва",
    baseKT: null,
    cities: {
      "Кызыл": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "18": {
    name: "Удмуртская Республика",
    baseKT: null,
    cities: {
      "Ижевск": 1.0,
      "Воткинск": 0.84,
      "Глазов, Сарапул": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "19": {
    name: "Республика Хакасия",
    baseKT: null,
    cities: {
      "Абакан, Саяногорск, Черногорск": 0.84,
      "Прочие города и НП": 0.76
    }
  },
  "20": { name: "Чеченская Республика", baseKT: 0.84, cities: null },
  "21": {
    name: "Чувашская Республика",
    baseKT: null,
    cities: {
      "Чебоксары": 1.0,
      "Канаш": 0.84,
      "Новочебоксарск": 0.84,
      "Прочие города и НП": 0.77
    }
  },

  // Края
  "22": {
    name: "Алтайский край",
    baseKT: null,
    cities: {
      "Барнаул": 1.0,
      "Бийск": 0.84,
      "Заринск, Новоалтайск, Рубцовск": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "75": {
    name: "Забайкальский край",
    baseKT: null,
    cities: {
      "Чита": 0.7,
	  "Краснокаменск": 0.76,
      "Прочие города и НП": 0.6
    }
  },
  "41": {
    name: "Камчатский край",
    baseKT: null,
    cities: {
      "Петропавловск-Камчатский": 1.0,
      "Прочие города и НП": 0.68
    }
  },
  "23": {
    name: "Краснодарский край",
    baseKT: null,
    cities: {
      "Краснодар, Новороссийск": 1.0,
      "Анапа, Геленджик": 0.84,
      "Армавир, Сочи, Туапсе": 0.84,
      "Белореченск, Ейск, Кропоткин, Крымск, Курганинск, Лабинск, Славянск-на-Кубани, Тимашевск, Тихорецк": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "24": {
    name: "Красноярский край",
    baseKT: null,
    cities: {
      "Красноярск": 1.0,
      "Ачинск, Зеленогорск": 0.84,
      "Железногорск, Норильск": 0.84,
      "Канск, Лесосибирск, Минусинск, Назарово": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "59": {
    name: "Пермский край",
    baseKT: null,
    cities: {
      "Пермь": 1.04,
      "Березники": 0.84,
      "Краснокамск": 0.84,
      "Лысьва, Чайковский": 0.84,
      "Соликамск": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "25": {
    name: "Приморский край",
    baseKT: null,
    cities: {
      "Владивосток": 1.0,
      "Арсеньев, Артем, Находка, Спасск-Дальний, Уссурийск": 0.88,
      "Прочие города и НП": 0.84
    }
  },
  "26": {
    name: "Ставропольский край",
    baseKT: null,
    cities: {
      "Кисловодск, Михайловск, Ставрополь": 0.84,
      "Буденновск, Георгиевск, Ессентуки, Минеральные Воды, Невинномысск, Пятигорск": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "27": {
    name: "Хабаровский край",
    baseKT: null,
    cities: {
      "Хабаровск": 1.0,
      "Амурск": 0.84,
      "Комсомольск-на-Амуре": 0.88,
      "Прочие города и НП": 0.77
    }
  },

  // Области
  "28": {
    name: "Амурская область",
    baseKT: null,
    cities: {
      "Благовещенск": 0.92,
      "Белогорск, Свободный": 0.92,
      "Прочие города и НП": 0.68
    }
  },
  "29": {
    name: "Архангельская область",
    baseKT: null,
    cities: {
      "Архангельск": 1.0,
      "Котлас": 1.0,
      "Северодвинск": 1.0,
      "Прочие города и НП": 0.6
    }
  },
  "30": {
    name: "Астраханская область",
    baseKT: null,
    cities: {
      "Астрахань": 1.0,
      "Прочие города и НП": 0.6
    }
  },
  "31": {
    name: "Белгородская область",
    baseKT: null,
    cities: {
      "Белгород": 0.84,
      "Губкин, Старый Оскол": 0.88,
      "Прочие города и НП": 0.6
    }
  },
  "32": {
    name: "Брянская область",
    baseKT: null,
    cities: {
      "Брянск": 1.0,
      "Клинцы": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "33": {
    name: "Владимирская область",
    baseKT: null,
    cities: {
      "Владимир": 1.0,
      "Гусь-Хрустальный": 0.84,
      "Муром": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "34": {
    name: "Волгоградская область",
    baseKT: null,
    cities: {
      "Волгоград": 0.84,
      "Волжский": 0.84,
      "Камышин, Михайловка": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "35": {
    name: "Вологодская область",
    baseKT: null,
    cities: {
      "Вологда": 1.0,
      "Череповец": 1.0,
      "Прочие города и НП": 0.6
    }
  },
  "36": {
    name: "Воронежская область",
    baseKT: null,
    cities: {
      "Воронеж": 0.92,
      "Борисоглебск, Лиски, Россошь": 0.92,
      "Прочие города и НП": 0.68
    }
  },
  "85": { name: "Запорожская область", baseKT: 0.68, cities: null },
  "37": {
    name: "Ивановская область",
    baseKT: null,
    cities: {
      "Иваново": 1.0,
      "Кинешма": 0.84,
      "Шуя": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "38": {
    name: "Иркутская область",
    baseKT: null,
    cities: {
      "Иркутск": 1.0,
      "Ангарск": 0.84,
      "Братск, Тулун, Усть-Илимск, Усть-Кут, Черемхово": 0.84,
      "Усолье-Сибирское": 0.84,
      "Шелехов": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "39": {
    name: "Калининградская область",
    baseKT: null,
    cities: {
      "Калининград": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "40": {
    name: "Калужская область",
    baseKT: null,
    cities: {
      "Калуга": 0.84,
      "Обнинск": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "42": {
    name: "Кемеровская область — Кузбасс",
    baseKT: null,
    cities: {
      "Кемерово": 1.0,
      "Анжеро-Судженск, Киселевск, Юрга": 0.84,
      "Белово, Березовский, Междуреченск, Осинники, Прокопьевск": 0.84,
      "Новокузнецк": 1.0,
      "Прочие города и НП": 0.84
    }
  },
  "43": {
    name: "Кировская область",
    baseKT: null,
    cities: {
      "Киров": 1.0,
      "Кирово-Чепецк": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "44": {
    name: "Костромская область",
    baseKT: null,
    cities: {
      "Кострома": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "45": {
    name: "Курганская область",
    baseKT: null,
    cities: {
      "Курган": 0.84,
      "Шадринск": 0.84,
      "Прочие города и НП": 0.77
    }
  },
  "46": {
    name: "Курская область",
    baseKT: null,
    cities: {
      "Курск": 0.84,
      "Железногорск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "47": { name: "Ленинградская область", baseKT: 0.84, cities: null },
  "48": {
    name: "Липецкая область",
    baseKT: null,
    cities: {
      "Липецк": 1.0,
      "Елец": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "49": {
    name: "Магаданская область",
    baseKT: null,
    cities: {
      "Магадан": 0.77,
      "Прочие города и НП": 0.77
    }
  },
  "50": { name: "Московская область", baseKT: 1.0, cities: null },
  "51": {
    name: "Мурманская область",
    baseKT: null,
    cities: {
      "Мурманск": 1.06,
      "Апатиты": 1.0,
      "Мончегорск": 1.0,
      "Североморск": 1.0,
      "Прочие города и НП": 1.0
    }
  },
  "52": {
    name: "Нижегородская область",
    baseKT: null,
    cities: {
      "Нижний Новгород": 1.0,
      "Арзамас, Выкса, Саров": 0.84,
      "Балахна, Бор, Дзержинск": 0.84,
      "Кстово": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "53": {
    name: "Новгородская область",
    baseKT: null,
    cities: {
      "Великий Новгород": 0.84,
      "Боровичи": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "54": {
    name: "Новосибирская область",
    baseKT: null,
    cities: {
      "Новосибирск": 2.0,
      "Бердск": 1.68,
      "Искитим": 1.68,
      "Куйбышев": 1.68,
      "Прочие города и НП": 1.52
    }
  },
  "55": {
    name: "Омская область",
    baseKT: null,
    cities: {
      "Омск": 1.0,
      "Прочие города и НП": 0.66
    }
  },
  "56": {
    name: "Оренбургская область",
    baseKT: null,
    cities: {
      "Оренбург": 1.0,
      "Бугуруслан, Бузулук, Новотроицк": 0.84,
      "Орск": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "57": {
    name: "Орловская область",
    baseKT: null,
    cities: {
      "Орел": 0.84,
      "Ливны, Мценск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "58": {
    name: "Пензенская область",
    baseKT: null,
    cities: {
      "Пенза": 1.0,
      "Заречный": 0.84,
      "Кузнецк": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "60": {
    name: "Псковская область",
    baseKT: null,
    cities: {
      "Псков": 0.84,
      "Великие Луки": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "61": {
    name: "Ростовская область",
    baseKT: null,
    cities: {
      "Ростов-на-Дону": 1.0,
      "Азов": 0.84,
      "Батайск": 0.84,
      "Волгодонск, Гуково, Каменск-Шахтинский, Новочеркасск, Новошахтинск, Сальск, Таганрог": 0.84,
      "Шахты": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "62": {
    name: "Рязанская область",
    baseKT: null,
    cities: {
      "Рязань": 1.0,
      "Прочие города и НП": 0.6
    }
  },
  "63": {
    name: "Самарская область",
    baseKT: null,
    cities: {
      "Самара": 1.0,
      "Новокуйбышевск, Сызрань": 0.84,
      "Тольятти": 1.0,
      "Чапаевск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "64": {
    name: "Саратовская область",
    baseKT: null,
    cities: {
      "Саратов": 1.0,
      "Балаково, Балашов, Вольск": 0.84,
      "Энгельс": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "65": {
    name: "Сахалинская область",
    baseKT: null,
    cities: {
      "Южно-Сахалинск": 1.0,
      "Прочие города и НП": 0.6
    }
  },
  "66": {
    name: "Свердловская область",
    baseKT: null,
    cities: {
      "Екатеринбург": 1.0,
      "Асбест, Ревда": 0.84,
      "Березовский, Верхняя Пышма, Первоуральск": 0.84,
      "Новоуральск": 0.84,
      "Полевской": 0.84,
      "Верхняя Салда": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "67": {
    name: "Смоленская область",
    baseKT: null,
    cities: {
      "Смоленск": 0.84,
      "Вязьма, Рославль, Сафоново, Ярцево": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "68": {
    name: "Тамбовская область",
    baseKT: null,
    cities: {
      "Тамбов": 0.84,
      "Мичуринск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "69": {
    name: "Тверская область",
    baseKT: null,
    cities: {
      "Тверь": 1.0,
      "Вышний Волочек, Кимры, Ржев": 0.84,
      "Прочие города и НП": 0.66
    }
  },
  "70": {
    name: "Томская область",
    baseKT: null,
    cities: {
      "Томск": 1.0,
      "Северск": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "71": {
    name: "Тульская область",
    baseKT: null,
    cities: {
      "Тула": 1.0,
      "Алексин, Ефремов, Новомосковск": 0.84,
      "Узловая, Щекино": 0.84,
      "Прочие города и НП": 0.6
    }
  },
  "72": {
    name: "Тюменская область",
    baseKT: null,
    cities: {
      "Тюмень": 1.04,
      "Тобольск": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "73": {
    name: "Ульяновская область",
    baseKT: null,
    cities: {
      "Ульяновск": 1.08,
      "Димитровград": 0.92,
      "Прочие города и НП": 0.68
    }
  },
  "84": { name: "Херсонская область", baseKT: 0.68, cities: null },
  "74": {
    name: "Челябинская область",
    baseKT: null,
    cities: {
      "Челябинск": 1.21,
      "Златоуст, Миасс": 0.84,
      "Копейск": 1.0,
      "Магнитогорск": 1.0,
      "Сатка, Чебаркуль": 0.84,
      "Прочие города и НП": 0.84
    }
  },
  "76": {
    name: "Ярославская область",
    baseKT: null,
    cities: {
      "Ярославль": 1.0,
      "Прочие города и НП": 0.66
    }
  },
  "79": {
    name: "Еврейская АО",
    baseKT: null,
    cities: {
      "Биробиджан": 0.84,
      "Прочие города и НП": 0.84
    }
  },

  // Автономные округи
  "83": { name: "Ненецкий АО", baseKT: 0.6, cities: null },
  "86": {
    name: "Ханты-Мансийский АО — Югра",
    baseKT: null,
    cities: {
      "Ханты-Мансийск": 1.00,
      "Когалым": 0.84,
      "Нефтеюганск, Нягань": 0.84,
      "Сургут": 1.06,
      "Нижневартовск": 1.0,
      "Прочие города и НП": 0.84
    }
  },
  "87": { name: "Чукотский АО", baseKT: 0.7, cities: null },
  "89": {
    name: "Ямало-Ненецкий АО",
    baseKT: null,
    cities: {
      "Новый Уренгой": 0.84,
      "Ноябрьск": 1.0,
      "Прочие города и НП": 0.84
    }
  },
  "99": { name: "Байконур", baseKT: 0.76, cities: null }
};
/* ===== 1. ТАБЛИЦЫ КВС (2026) ===== */
const KVS_AUTO_TABLE = [
  [2.27, 1.92, 1.84, 1.65, 1.62], // 18-21
  [1.88, 1.72, 1.71, 1.13, 1.10, 1.09], // 22-24
  [1.72, 1.60, 1.54, 1.09, 1.08, 1.07, 1.02], // 25-29
  [1.56, 1.50, 1.48, 1.05, 1.04, 1.01, 0.97, 0.95], // 30-34
  [1.54, 1.47, 1.46, 1.00, 0.97, 0.95, 0.94, 0.93], // 35-39
  [1.50, 1.44, 1.43, 0.96, 0.95, 0.94, 0.93, 0.91], // 40-49
  [1.46, 1.40, 1.39, 0.93, 0.92, 0.91, 0.90, 0.86], // 50-59
  [1.43, 1.36, 1.35, 0.91, 0.90, 0.89, 0.88, 0.83]  // 60+
];

const KVS_MOTO_TABLE = [
  [2.27, 2.23, 2.02, 1.8, 1.5], // 16-21
  [2.23, 2.23, 2.02, 1.73, 1.49, 1.44], // 22-24
  [2.01, 2.01, 1.81, 1.57, 1.35, 1.29, 1.17], // 25-29
  [1.7, 1.7, 1.54, 1.33, 1.13, 1.08, 1.01, 0.96], // 30-34
  [1.51, 1.51, 1.37, 1.19, 1.01, 0.96, 0.9, 0.89], // 35-39
  [1.43, 1.43, 1.3, 1.12, 0.95, 0.91, 0.85, 0.84], // 40-49
  [1.39, 1.39, 1.26, 1.08, 0.92, 0.87, 0.82, 0.81], // 50-59
  [1.15, 1.12, 1.01, 0.91, 0.86, 0.81, 0.79, 0.76]  // 60+
];

let currentKT = 1;

/* ===== 2. ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ ===== */

// Маска для ввода даты (ДД.ММ.ГГГГ)
function applyDateMask(el) {
  el.addEventListener('input', (e) => {
    let v = e.target.value.replace(/\D/g, '');
    if (v.length > 8) v = v.substring(0, 8);
    if (v.length > 4) v = v.substring(0, 2) + '.' + v.substring(2, 4) + '.' + v.substring(4);
    else if (v.length > 2) v = v.substring(0, 2) + '.' + v.substring(2);
    e.target.value = v;
  });
}

// Парсинг даты из формата ДД.ММ.ГГГГ
function getAgeFromStr(dateStr) {
  if (!dateStr || dateStr.length < 10) return 0;
  const parts = dateStr.split('.');
  const birthDate = new Date(parts[2], parts[1] - 1, parts[0]);
  const now = new Date();
  let age = now.getFullYear() - birthDate.getFullYear();
  const m = now.getMonth() - birthDate.getMonth();
  if (m < 0 || (m === 0 && now.getDate() < birthDate.getDate())) age--;
  return age < 0 ? 0 : age;
}

function getKvsValue(age, exp, isMoto) {
  const table = isMoto ? KVS_MOTO_TABLE : KVS_AUTO_TABLE;
  
  // 1. Определяем индекс строки (Возраст)
  // Для обеих ваших новых таблиц сетка возраста совпадает (8 строк)
  let rowIndex = age >= 60 ? 7 : age >= 50 ? 6 : age >= 40 ? 5 : age >= 35 ? 4 : 
                 age >= 30 ? 3 : age >= 25 ? 2 : age >= 22 ? 1 : 0;

  // 2. Определяем идеальный индекс столбца (Стаж)
  // 0, 1, 2, 3, 4, 5-6(5), 7-9(6), 10-14(7)
  let targetCol = exp >= 14 ? 7 : exp >= 10 ? 6 : exp >= 7 ? 5 : exp >= 5 ? 4 : 
                  exp >= 3 ? 3 : exp >= 2 ? 2 : exp >= 1 ? 1 : 0;

  // 3. ПРЕДОХРАНИТЕЛЬ:
  // Если в этой строке меньше столбцов, чем нам нужно (например, в строке [0] всего 5 элементов),
  // мы берем последний доступный элемент в этой строке.
  const currentRow = table[rowIndex];
  const colIndex = Math.min(targetCol, currentRow.length - 1);

  return currentRow[colIndex];
}

/* ===== 3. ЛОГИКА КАЛЬКУЛЯТОРА ===== */

function updateKT() {
  const regionEl = document.getElementById('region');
  const vehicleEl = document.getElementById('vehicle');
  const cityBox = document.getElementById('cityBlock');
  const cityEl = document.getElementById('city');
  
  const regionCode = regionEl.value;
  // Проверяем, выбрана ли категория тракторов
  const isTractor = vehicleEl.options[vehicleEl.selectedIndex].text.includes('Тракторы');

  // Выбираем, какой словарь использовать
  const activeMap = isTractor ? KT_TRACTOR_MAP : KT_MAP;

  const regionData = activeMap[regionCode];

  if (!regionData) {
    cityBox.style.display = 'none';
    currentKT = 1;
    return;
  }

  if (regionData.baseKT !== null) {
    // Если для региона фиксированный КТ
    cityBox.style.display = 'none';
    currentKT = regionData.baseKT;
  } else {
    // Если нужно выбирать город
    cityBox.style.display = 'block';
    cityEl.innerHTML = '';
    
    for (const name in regionData.cities) {
      const opt = document.createElement('option');
      opt.value = regionData.cities[name];
      opt.textContent = name;
      cityEl.appendChild(opt);
    }
    // Устанавливаем КТ из первого города в списке
    currentKT = parseFloat(cityEl.value);
  }
}

function calcOSAGO() {
  const vehicleEl = document.getElementById('vehicle');
  const noLimits = document.getElementById('noLimits').checked;
  const kbmEl = document.getElementById('kbm');
  const ksSelect = document.getElementById('ks');
  const birthInput = document.getElementById('birthDate');
  const expInput = document.getElementById('experienceDate');
  const kvsBlock = document.getElementById('kvsBlock');

  const basePrice = parseFloat(vehicleEl.value) || 0;
  const vehicleText = vehicleEl.options[vehicleEl.selectedIndex].text;

  // 1. Определяем тип ТС
  const isMoto = vehicleText.includes('A ') || vehicleText.includes('M ');
  const isAuto = vehicleText.includes('B ') || vehicleText.includes('Такси');

  // 2. Рассчитываем коэффициенты
  let ko = 1, kbm = parseFloat(kbmEl.value) || 1, kvs = 1, ks = parseFloat(ksSelect.value) || 1;

  if (noLimits) {
    ko = 3.16; 
    kbm = 1.17; 
    kvs = 1;
    if(kbmEl) kbmEl.disabled = true;
    if(birthInput) birthInput.disabled = true;
    if(expInput) expInput.disabled = true;
  } else {
    if(kbmEl) kbmEl.disabled = false;
    if(birthInput) birthInput.disabled = false;
    if(expInput) expInput.disabled = false;
    const age = getAgeFromStr(birthInput.value);
    const exp = getAgeFromStr(expInput.value);
    kvs = getKvsValue(age, exp, isMoto);
  }
  
  if (kvsBlock) {
  // Если галочка стоит, скрываем блок, иначе - показываем
  kvsBlock.style.display = noLimits ? 'none' : 'block';
}

  // 3. Мощность (KM)
  let km = 1;
  const pMotoBlock = document.getElementById('powerMoto');
  const pAutoBlock = document.getElementById('powerAuto');

  if (pMotoBlock) pMotoBlock.style.display = isMoto ? 'block' : 'none';
  if (pAutoBlock) pAutoBlock.style.display = isAuto ? 'block' : 'none';

  if (isMoto) {
    const pVal = document.getElementById('powerMotoValue');
    km = pVal ? parseFloat(pVal.value) : 1;
  } else if (isAuto) {
    const pVal = document.getElementById('powerAutoValue');
    km = pVal ? parseFloat(pVal.value) : 1;
  }

  // 4. ИТОГОВЫЙ РАСЧЕТ
  const final = Math.round(basePrice * currentKT * kbm * kvs * ko * km * ks);

  // 5. ЗАПОЛНЕНИЕ ТАБЛИЦЫ СПРАВА
  // Обновляем итоговую сумму
  const resultEl = document.getElementById('result');
  if (resultEl) resultEl.innerText = `${final.toLocaleString()} ₽`;
  
  // Функция для безопасного обновления ячеек таблицы
  const updateTableCell = (id, value) => {
    const el = document.getElementById(id);
    if (el) el.innerText = value;
  };

  updateTableCell('val-bt', basePrice);
  updateTableCell('val-kt', currentKT);
  updateTableCell('val-kbm', kbm);
  updateTableCell('val-kvs', kvs);
  updateTableCell('val-ko', ko);
  updateTableCell('val-km', km);
  updateTableCell('val-ks', ks);
}

/* ===== ОБНОВЛЕННАЯ ИНИЦИАЛИЗАЦИЯ ===== */
/* ===== ОБНОВЛЕННАЯ ИНИЦИАЛИЗАЦИЯ ===== */
document.addEventListener('DOMContentLoaded', () => {
  const birthInput = document.getElementById('birthDate');
  const expInput = document.getElementById('experienceDate');
  const vehicleSelect = document.getElementById('vehicle');
  const regionSelect = document.getElementById('region');
  const citySelect = document.getElementById('city');

  if (birthInput) applyDateMask(birthInput);
  if (expInput) applyDateMask(expInput);

  // 1. ЗАГРУЗКА ИЗ ПАМЯТИ ПРИ СТАРТЕ
  const savedVehicle = localStorage.getItem('vehicle');
  const savedRegion = localStorage.getItem('region');
  const savedCity = localStorage.getItem('city');

  if (savedVehicle) vehicleSelect.value = savedVehicle;
  
  if (savedRegion) {
    regionSelect.value = savedRegion;
    // Наполняем список городов для сохраненного региона
    updateKT(); 
    
    // Если город тоже был сохранен, выбираем его
    if (savedCity) {
      // Небольшая задержка, чтобы список городов успел прогрузиться в DOM
      citySelect.value = savedCity;
      // Обновляем текущий KT из значения выбранного города
      currentKT = parseFloat(citySelect.value) || 1;
    }
  } else {
    // Если памяти нет, просто запускаем стандартное наполнение
    updateKT();
  }

  // 2. СЛЕДИМ ЗА ВСЕМИ ПОЛЯМИ
  const ids = [
    'vehicle', 'region', 'city', 'noLimits', 'kbm', 
    'birthDate', 'experienceDate', 'ks',
    'powerMotoValue', 'powerAutoValue'
  ];
  
  ids.forEach(id => {
    const el = document.getElementById(id);
    if (el) {
      const eventType = (id === 'birthDate' || id === 'experienceDate') ? 'input' : 'change';

      el.addEventListener(eventType, () => {
        // Сохраняем выбор в память
        if (id === 'region' || id === 'city' || id === 'vehicle') {
          localStorage.setItem(id, el.value);
        }

        if (id === 'vehicle' || id === 'region') {
          updateKT();
        }
        
        if (id === 'city') {
          currentKT = parseFloat(el.value);
        }
        calcOSAGO();
      });
    }
  });

  updateKT();
  calcOSAGO();
});
</script>
